In [5]:

import pandas as pd

name1 = ['송중기', '권보아', '김나현', '박효신', '진달래']
a1, a2, a3, a4, a5 = '송중기', '권보아', '김나현', '박효신', '진달래'
b1, b2, b3 = '카페라떼', '아이스티', '모카라떼'
c1, c2 = '콩다방', '별다방'
df1 = pd.DataFrame([name1, [b2, b1, b1, b2, b3]], index=["이름", "제품"]).T
df2 = pd.DataFrame([[b1, 4500], [b2, 4600], [b3, 4800]], columns=["제품", "가격"])
df3 = pd.DataFrame([name1,[c1, c1, c2, c1, c2], [b2, b1, b1, b2, b2]], 
                   index=["이름", "업체", "제품"]).T
df4 = pd.DataFrame([[c1, b2, 4600], [c1, b1, 4700], [c2, b2, 4200], [c2, b1, 4300]], 
                   columns=["업체", "제품", "가격"])
df5 = pd.DataFrame([[b1, 4500], [b2, 4600], [b3, 4800]], columns=["상품", "가격"])
df6 = pd.DataFrame([[b1, 4500], [b2, 4600], [b3, 4800], [b3, 4800]], 
                   columns=["제품", "가격"])
df7 = pd.DataFrame([[a2, a3, a1, a5], [b2, b1, b1, b3]], index=["이름", "1일차"]).T
df8 = pd.DataFrame([[a2, a3, a4, a1], [b1, b3, b2, b2]], index=["이름", "2일차"]).T
df9 = pd.DataFrame([b1, b3, b2, b2], index=[a2, a3, a4, a1], columns=["2일차"])

# 1. 엑셀의 VLOOKUP처럼 데이터프레임을 병합

In [6]:
df1.merge(df2, how = "left")

    이름    제품    가격
0  송중기  아이스티  4600
1  권보아  카페라떼  4500
2  김나현  카페라떼  4500
3  박효신  아이스티  4600
4  진달래  모카라떼  4800

# 2. 복수의열 기준(다중요건VLOOKUP)병합

In [12]:
df3.merge(df4 ,on = ["업체", "제품"] , how = "left")

    이름   업체    제품    가격
0  송중기  콩다방  아이스티  4600
1  권보아  콩다방  카페라떼  4700
2  김나현  별다방  카페라떼  4300
3  박효신  콩다방  아이스티  4600
4  진달래  별다방  아이스티  4200

# 3. 두 데이터프레임의 열이름이 다를 때 merge
## rename으로 열이름을 바꾼다.

In [20]:
df5.rename(columns={"상품": "제품"})
df1.merge(df5.rename(columns={"상품": "제품"}), how = "left")

    이름    제품    가격
0  송중기  아이스티  4600
1  권보아  카페라떼  4500
2  김나현  카페라떼  4500
3  박효신  아이스티  4600
4  진달래  모카라떼  4800

# 4. 중복행이 있을 때의 merge

In [24]:
df1.merge(df6, how="left").drop_duplicates().reset_index(drop=True)

    이름    제품    가격
0  송중기  아이스티  4600
1  권보아  카페라떼  4500
2  김나현  카페라떼  4500
3  박효신  아이스티  4600
4  진달래  모카라떼  4800

# 5. merge의 조인방식

In [25]:
df7.merge(df8, how = "inner")

    이름   1일차   2일차
0  권보아  아이스티  카페라떼
1  김나현  카페라떼  모카라떼
2  송중기  카페라떼  아이스티

In [30]:
df7.merge(df8,how = "outer")
          #합집합

    이름   1일차   2일차
0  권보아  아이스티  카페라떼
1  김나현  카페라떼  모카라떼
2  송중기  카페라떼  아이스티
3  진달래  모카라떼   NaN
4  박효신   NaN  아이스티

In [32]:
df7.merge(df8, how ="right")
# df8의 이름열을 축으로..

    이름   1일차   2일차
0  권보아  아이스티  카페라떼
1  김나현  카페라떼  모카라떼
2  박효신   NaN  아이스티
3  송중기  카페라떼  아이스티

# 6. column이 아닐때 Merge

In [37]:
df7.merge(df9.reset_index().rename(columns={"index": "이름"}), how= "left")

    이름   1일차   2일차
0  권보아  아이스티  카페라떼
1  김나현  카페라떼  모카라떼
2  송중기  카페라떼  아이스티
3  진달래  모카라떼   NaN

In [ ]:
)